---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FormatOptions Properties
FormatOptions Class See Also Send Feedback
---

The FormatOptions type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Accuracy | The accuracy to which values will be rounded. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | RoundingMethod | The method used to round values: round to nearest, round up, or round down. |
|  | SuppressLeadingZeros | Indicates if leading zeros should be suppressed in feet and fractional inches. |
|  | SuppressSpaces | Indicates if spaces around the dash should be suppressed in feet and fractional inches. |
|  | SuppressTrailingZeros | Indicates if trailing zeros after the decimal point should be suppressed. |
|  | UseDefault | Indicates whether default or custom formatting should be used. |
|  | UseDigitGrouping | Indicates if digit grouping symbols should be displayed. |
|  | UsePlusPrefix | Indicates if a plus sign prefix should be displayed for positive and zero values. |

# See Also

FormatOptions Class

Autodesk.Revit.DB Namespace